In [1]:
# importing all the necessary library
import pandas as pd
import numpy as np
import json

In [2]:
# importing dataset from csv files
df1=pd.read_csv("users_data.csv")
df2=pd.read_csv("cards_data.csv")
df3=pd.read_csv("transactions_data.csv")

In [3]:
# importing data from json file
with open('mcc_codes.json', 'r') as file:
    codes = json.load(file)
codes

{'5812': 'Eating Places and Restaurants',
 '5541': 'Service Stations',
 '7996': 'Amusement Parks, Carnivals, Circuses',
 '5411': 'Grocery Stores, Supermarkets',
 '4784': 'Tolls and Bridge Fees',
 '4900': 'Utilities - Electric, Gas, Water, Sanitary',
 '5942': 'Book Stores',
 '5814': 'Fast Food Restaurants',
 '4829': 'Money Transfer',
 '5311': 'Department Stores',
 '5211': 'Lumber and Building Materials',
 '5310': 'Discount Stores',
 '3780': 'Computer Network Services',
 '5499': 'Miscellaneous Food Stores',
 '4121': 'Taxicabs and Limousines',
 '5300': 'Wholesale Clubs',
 '5719': 'Miscellaneous Home Furnishing Stores',
 '7832': 'Motion Picture Theaters',
 '5813': 'Drinking Places (Alcoholic Beverages)',
 '4814': 'Telecommunication Services',
 '5661': 'Shoe Stores',
 '5977': 'Cosmetic Stores',
 '8099': 'Medical Services',
 '7538': 'Automotive Service Shops',
 '5912': 'Drug Stores and Pharmacies',
 '4111': 'Local and Suburban Commuter Transportation',
 '5815': 'Digital Goods - Media, Books, Apps',
 '8021': 'Dentists and Orthodontists',
 '5921': 'Package Stores, Beer, Wine, Liquor',
 '5655': 'Sports Apparel, Riding Apparel Stores',
 '7230': 'Beauty and Barber Shops',
 '3390': 'Miscellaneous Metalwork',
 '7922': 'Theatrical Producers',
 '3722': 'Passenger Railways',
 '5651': 'Family Clothing Stores',
 '4899': 'Cable, Satellite, and Other Pay Television Services',
 '5251': 'Hardware Stores',
 '7995': 'Betting (including Lottery Tickets, Casinos)',
 '3596': 'Miscellaneous Machinery and Parts Manufacturing',
 '3730': 'Ship Chandlers',
 '9402': 'Postal Services - Government Only',
 '7801': 'Athletic Fields, Commercial Sports',
 '5970': 'Artist Supply Stores, Craft Shops',
 '5932': 'Antique Shops',
 '5621': "Women's Ready-To-Wear Stores",
 '7349': 'Cleaning and Maintenance Services',
 '4722': 'Travel Agencies',
 '5193': 'Florists Supplies, Nursery Stock and Flowers',
 '3775': 'Railroad Freight',
 '3684': 'Semiconductors and Related Devices',
 '5045': 'Computers, Computer Peripheral Equipment',
 '3504': 'Gardening Supplies',
 '7011': 'Lodging - Hotels, Motels, Resorts',
 '8041': 'Chiropractors',
 '4214': 'Motor Freight Carriers and Trucking',
 '6300': 'Insurance Sales, Underwriting',
 '8011': 'Doctors, Physicians',
 '3509': 'Industrial Equipment and Supplies',
 '7210': 'Laundry Services',
 '5192': 'Books, Periodicals, Newspapers',
 '7542': 'Car Washes',
 '3640': 'Lighting, Fixtures, Electrical Supplies',
 '7393': 'Detective Agencies, Security Services',
 '8111': 'Legal Services and Attorneys',
 '3771': 'Railroad Passenger Transport',
 '5732': 'Electronics Stores',
 '5094': 'Precious Stones and Metals',
 '5712': 'Furniture, Home Furnishings, and Equipment Stores',
 '5816': 'Digital Goods - Games',
 '7802': 'Recreational Sports, Clubs',
 '3389': 'Non-Precious Metal Services',
 '8043': 'Optometrists, Optical Goods and Eyeglasses',
 '3393': 'Heat Treating Metal Services',
 '3174': 'Upholstery and Drapery Stores',
 '3001': 'Steel Products Manufacturing',
 '3395': 'Welding Repair',
 '3058': 'Tools, Parts, Supplies Manufacturing',
 '8049': 'Podiatrists',
 '3387': 'Electroplating, Plating, Polishing Services',
 '4112': 'Passenger Railways',
 '3405': 'Ironwork',
 '5261': 'Lawn and Garden Supply Stores',
 '3144': 'Floor Covering Stores',
 '3132': 'Leather Goods',
 '3359': 'Non-Ferrous Metal Foundries',
 '8931': 'Accounting, Auditing, and Bookkeeping Services',
 '8062': 'Hospitals',
 '7276': 'Tax Preparation Services',
 '4131': 'Bus Lines',
 '3260': 'Pottery and Ceramics',
 '3256': 'Brick, Stone, and Related Materials',
 '3006': 'Miscellaneous Fabricated Metal Products',
 '7531': 'Automotive Body Repair Shops',
 '1711': 'Heating, Plumbing, Air Conditioning Contractors',
 '5947': 'Gift, Card, Novelty Stores',
 '3007': 'Coated and Laminated Products',
 '4511': 'Airlines',
 '3075': 'Bolt, Nut, Screw, Rivet Manufacturing',
 '3066': 'Miscellaneous Metals',
 '3005': 'Miscellaneous Metal Fabrication',
 '4411': 'Cruise Lines',
 '3000': 'Steelworks',
 '5533': 'Automotive Parts and Accessories Stores',
 '3008': 'Steel Drums and Barrels',
 '7549': 'Towing Services',
 '5941': 'Sporting Goods Stores',
 '5722': 'Household Appliance Stores',
 '3009': 'Fabricated Structural Metal Products',
 '5733': 'Music Stores - Musical Instruments'}

In [4]:
# converting data of json file into datframe
df4 = pd.DataFrame(list(codes.items()), columns=['mcc_id', 'category'])

In [5]:
# importing data from json file
with open('train_fraud_labels.json', 'r') as file:
    fraud = json.load(file)
fraud

{'target': {'10649266': 'No',
  '23410063': 'No',
  '9316588': 'No',
  '12478022': 'No',
  '9558530': 'No',
  '12532830': 'No',
  '19526714': 'No',
  '9906964': 'No',
  '13224888': 'No',
  '13749094': 'No',
  '12303776': 'No',
  '19480376': 'No',
  '11716050': 'No',
  '20025400': 'No',
  '7661688': 'No',
  '16662807': 'No',
  '21419778': 'No',
  '18011186': 'No',
  '23289598': 'No',
  '11644547': 'No',
  '23235120': 'No',
  '19748218': 'No',
  '8720720': 'No',
  '18335831': 'No',
  '18936727': 'No',
  '15223870': 'No',
  '12370203': 'No',
  '17126661': 'No',
  '22270430': 'No',
  '18790248': 'No',
  '20143410': 'No',
  '9497252': 'No',
  '17619208': 'No',
  '11052664': 'No',
  '14670204': 'No',
  '17681877': 'No',
  '22485981': 'No',
  '22332853': 'No',
  '16628447': 'No',
  '7766832': 'No',
  '7614276': 'No',
  '14069486': 'No',
  '13755628': 'No',
  '17306332': 'No',
  '19822702': 'No',
  '19118845': 'No',
  '12799754': 'No',
  '17368331': 'No',
  '23652500': 'No',
  '14024256': 'No',
  '12296764': 'No',
  '16044038': 'No',
  '22500112': 'No',
  '12343484': 'No',
  '15796886': 'No',
  '23508044': 'No',
  '11816240': 'No',
  '16807249': 'No',
  '13646156': 'No',
  '17312276': 'No',
  '12404354': 'No',
  '11778392': 'No',
  '18375038': 'No',
  '11928442': 'No',
  '19938487': 'No',
  '22467943': 'No',
  '23178467': 'No',
  '13722519': 'No',
  '14128545': 'No',
  '8912775': 'No',
  '19850291': 'No',
  '21941829': 'No',
  '9909258': 'No',
  '14262715': 'No',
  '10802893': 'No',
  '18409086': 'No',
  '10933230': 'No',
  '16405789': 'No',
  '10139688': 'No',
  '21881780': 'No',
  '17798976': 'No',
  '17207523': 'No',
  '15427215': 'No',
  '13115972': 'No',
  '8643060': 'No',
  '9374178': 'No',
  '14474479': 'No',
  '10478729': 'No',
  '22836043': 'No',
  '8500674': 'No',
  '17910114': 'No',
  '23380439': 'No',
  '23292183': 'No',
  '23722607': 'No',
  '14058158': 'No',
  '10462724': 'No',
  '18033208': 'No',
  '19068759': 'No',
  '10551289': 'No',
  '22484160': 'No',
  '11247457': 'No',
  '21767303': 'No',
  '21271918': 'No',
  '21263370': 'No',
  '14611854': 'No',
  '14261665': 'No',
  '16932356': 'No',
  '10016376': 'No',
  '14013183': 'No',
  '11202999': 'No',
  '19565729': 'No',
  '14609760': 'No',
  '16472199': 'No',
  '23130510': 'No',
  '14802347': 'No',
  '19987563': 'No',
  '15328765': 'No',
  '17465465': 'No',
  '18801955': 'No',
  '15674627': 'No',
  '11623435': 'No',
  '10415008': 'No',
  '12205959': 'No',
  '15105184': 'No',
  '7825558': 'No',
  '8555018': 'No',
  '9147061': 'No',
  '15492657': 'No',
  '12705924': 'No',
  '17696068': 'No',
  '19910946': 'No',
  '9934244': 'No',
  '9064963': 'No',
  '9844720': 'No',
  '20803736': 'No',
  '18049394': 'No',
  '9636708': 'No',
  '8112022': 'No',
  '18465623': 'No',
  '17989560': 'No',
  '8134329': 'No',
  '22038543': 'No',
  '23403057': 'No',
  '8386054': 'No',
  '20718262': 'No',
  '9679353': 'No',
  '16631889': 'No',
  '11856496': 'No',
  '13684422': 'No',
  '8530860': 'No',
  '17088486': 'No',
  '12753891': 'No',
  '21039152': 'No',
  '8239030': 'No',
  '18323381': 'No',
  '15619849': 'No',
  '19418150': 'No',
  '14632442': 'No',
  '11202687': 'No',
  '20852455': 'No',
  '17479972': 'No',
  '19165317': 'No',
  '20308107': 'No',
  '8127094': 'No',
  '10057074': 'No',
  '15455354': 'No',
  '15990953': 'No',
  '19747498': 'No',
  '12265212': 'No',
  '9356556': 'No',
  '14470700': 'No',
  '21042836': 'No',
  '9322759': 'No',
  '12964472': 'No',
  '23554065': 'No',
  '11250341': 'No',
  '15469775': 'No',
  '17481440': 'No',
  '10196919': 'No',
  '18636852': 'No',
  '21993708': 'No',
  '23188669': 'No',
  '15362343': 'No',
  '12226089': 'No',
  '16965193': 'No',
  '9653284': 'No',
  '17916057': 'No',
  '19802578': 'No',
  '16969942': 'No',
  '10971426': 'No',
  '8194016': 'No',
  '17892266': 'No',
  '23035208': 'No',
  '12644644': 'No',
  '22029155': 'No',
  '18464548': 'No',
  '10546462': 'No',
  '17123489': 'No',
  '19380704': 'No',
  '15047238': 'No',
  '22368669': 'No',
  '13373437': 'No',
  '16306027': 'No',
  '21186385': 'No',
  '9961228': 'No',
  '22043643': 'No',
  '16253374': 'No',
  '12065423': 'No',
  '10414272': 'No',
  '10219390': 'No',
  '20581004': 'No',
  '17682305': 'No',
  '8846732': 'No',
  '10896291': 'No',
  '14264764': 'No',
  '19616621': 'No',
  '15022167': 'No',
  '10657296': 'No',
  '18643813': 'No',
  '22542687': 'No',
  '9322155': 'No',
  '11373991': 'No',
  '13462710': 'No',
  '16046252': 'No',
  '17982323': 'No',
  '22615101': 'No',
  '11979837': 'No',
  '17180155': 'No',
  '10106772': 'No',
  '12668673': 'No',
  '13175573': 'No',
  '14102906': 'No',
  '20011023': 'No',
  '21286920': 'No',
  '11436023': 'No',
  '21113134': 'No',
  '11498175': 'No',
  '20677456': 'No',
  '19017069': 'No',
  '14799984': 'No',
  '8950155': 'No',
  '8815928': 'No',
  '11292426': 'No',
  '20952238': 'No',
  '12578829': 'No',
  '12971352': 'No',
  '21172123': 'No',
  '23507960': 'No',
  '8519487': 'No',
  '10248876': 'No',
  '11893909': 'No',
  '9762219': 'No',
  '13034342': 'No',
  '11703881': 'No',
  '17788775': 'No',
  '16691331': 'No',
  '8785990': 'No',
  '10671970': 'No',
  '16807555': 'No',
  '9420407': 'No',
  '15031532': 'No',
  '19048773': 'No',
  '12502151': 'No',
  '13702377': 'No',
  '10224315': 'No',
  '17936073': 'No',
  '15764443': 'No',
  '17009463': 'No',
  '16632490': 'No',
  '17299021': 'No',
  '9935956': 'No',
  '18698685': 'No',
  '13017451': 'No',
  '16207539': 'No',
  '20850143': 'No',
  '22248479': 'No',
  '9075658': 'No',
  '20565399': 'No',
  '7582194': 'No',
  '20118823': 'No',
  '7921554': 'No',
  '16133520': 'No',
  '11800380': 'No',
  '10542868': 'No',
  '7889483': 'No',
  '17099367': 'No',
  '13307471': 'No',
  '9694643': 'No',
  '12194745': 'No',
  '8379138': 'No',
  '11855754': 'No',
  '8779254': 'No',
  '9220875': 'No',
  '18722546': 'No',
  '7929291': 'No',
  '20744109': 'No',
  '21782760': 'No',
  '22341116': 'No',
  '12127474': 'No',
  '20445218': 'No',
  '15195835': 'No',
  '11026048': 'No',
  '23680261': 'No',
  '20606081': 'No',
  '23358817': 'No',
  '18209821': 'No',
  '8458040': 'No',
  '17226297': 'No',
  '14933079': 'No',
  '19034571': 'No',
  '21272123': 'No',
  '20200091': 'No',
  '22316670': 'No',
  '22311205': 'No',
  '20103589': 'No',
  '20573228': 'No',
  '17610289': 'No',
  '11566462': 'No',
  '10311093': 'No',
  '17483935': 'No',
  '15611661': 'No',
  '14860246': 'No',
  '19771592': 'No',
  '10868852': 'No',
  '21469649': 'No',
  '16646399': 'No',
  '17693002': 'No',
  '16510196': 'No',
  '10482938': 'No',
  '20009307': 'No',
  '18971434': 'No',
  '8151033': 'No',
  '11097641': 'No',
  '12711845': 'No',
  '17866257': 'No',
  '18008984': 'No',
  '20907033': 'No',
  '8025279': 'No',
  '10579003': 'No',
  '8778220': 'No',
  '14622719': 'No',
  '22560297': 'No',
  '9203913': 'No',
  '23211439': 'No',
  '15192420': 'No',
  '23059972': 'No',
  '23126983': 'No',
  '11202673': 'No',
  '12565782': 'No',
  '22787218': 'No',
  '9349555': 'No',
  '17453914': 'No',
  '15292787': 'No',
  '9761414': 'No',
  '16337538': 'No',
  '10162209': 'No',
  '13644438': 'No',
  '8037254': 'No',
  '22643345': 'No',
  '10774091': 'No',
  '11939913': 'No',
  '16902965': 'No',
  '17505634': 'No',
  '8981486': 'No',
  '10973589': 'No',
  '17122657': 'No',
  '23486403': 'No',
  '15523287': 'No',
  '20477353': 'No',
  '20750469': 'No',
  '10631578': 'No',
  '11396795': 'No',
  '11754393': 'No',
  '19711842': 'No',
  '7949019': 'No',
  '17753087': 'No',
  '9305042': 'No',
  '11365205': 'No',
  '8663630': 'No',
  '13503182': 'No',
  '11733923': 'No',
  '8892313': 'No',
  '9872957': 'No',
  '21872486': 'No',
  '9740835': 'No',
  '17140642': 'No',
  '10074624': 'No',
  '14660219': 'No',
  '16265487': 'No',
  '23315421': 'No',
  '19131910': 'No',
  '8690792': 'No',
  '23218879': 'No',
  '12402696': 'No',
  '12496998': 'No',
  '20032764': 'No',
  '10898837': 'No',
  '10084676': 'No',
  '11983626': 'No',
  '14086129': 'No',
  '13221376': 'No',
  '20227633': 'No',
  '11601012': 'No',
  '19958982': 'No',
  '17881824': 'No',
  '21671733': 'No',
  '10193973': 'No',
  '17555606': 'No',
  '15218651': 'No',
  '12201954': 'No',
  '13940094': 'No',
  '10989693': 'No',
  '13387505': 'No',
  '9257660': 'No',
  '18287917': 'No',
  '14197866': 'No',
  '11759453': 'No',
  '18077603': 'No',
  '22224710': 'No',
  '8049097': 'No',
  '12006017': 'No',
  '16384013': 'No',
  '19024213': 'No',
  '15390112': 'No',
  '12896780': 'No',
  '21841156': 'No',
  '13293121': 'No',
  '22404432': 'No',
  '13396143': 'No',
  '22910657': 'No',
  '12645035': 'No',
  '19966259': 'No',
  '14920345': 'No',
  '15891595': 'No',
  '16057738': 'No',
  '23065069': 'No',
  '10870335': 'No',
  '22411428': 'No',
  '10897258': 'No',
  '10951977': 'No',
  '18987864': 'No',
  '8962251': 'No',
  '8052629': 'No',
  '18679883': 'No',
  '16161220': 'No',
  '12358940': 'No',
  '23461902': 'No',
  '13402635': 'No',
  '20149642': 'No',
  '21547795': 'No',
  '7801437': 'No',
  '7825120': 'No',
  '15324516': 'No',
  '18457268': 'No',
  '12150676': 'No',
  '10028525': 'No',
  '8505773': 'No',
  '10880653': 'No',
  '12715889': 'No',
  '14798574': 'No',
  '17772438': 'No',
  '9718649': 'No',
  '11192065': 'No',
  '13161333': 'No',
  '12197514': 'No',
  '20204927': 'No',
  '19760453': 'No',
  '23476426': 'No',
  '7762511': 'No',
  '19946381': 'No',
  '9661883': 'No',
  '10513025': 'No',
  '9364330': 'No',
  '23202389': 'No',
  '10337157': 'No',
  '13317205': 'No',
  '21569147': 'No',
  '8352182': 'No',
  '15894795': 'No',
  '11690445': 'No',
  '22978302': 'No',
  '14780884': 'No',
  '20119003': 'No',
  '13680769': 'No',
  '7995573': 'No',
  '19926533': 'No',
  '14674901': 'No',
  '16311131': 'No',
  '18021895': 'No',
  '9854743': 'No',
  '11588200': 'No',
  '23144341': 'No',
  '17286618': 'No',
  '22766354': 'No',
  '22742703': 'No',
  '20683053': 'No',
  '16809462': 'No',
  '8797944': 'No',
  '12580306': 'No',
  '15175635': 'No',
  '13414824': 'No',
  '22755152': 'No',
  '14587978': 'No',
  '13445354': 'No',
  '13295352': 'No',
  '9343604': 'No',
  '14103406': 'No',
  '13734274': 'No',
  '16632968': 'No',
  '7824644': 'No',
  '9119877': 'No',
  '7641269': 'No',
  '17225607': 'No',
  '12658457': 'No',
  '10661657': 'No',
  '7743563': 'No',
  '7947694': 'No',
  '19915529': 'No',
  '14608886': 'No',
  '19745572': 'No',
  '19950417': 'No',
  '9408405': 'No',
  '10428953': 'No',
  '19274695': 'No',
  '15144268': 'No',
  '15560217': 'No',
  '15075908': 'No',
  '13927485': 'No',
  '18117703': 'No',
  '15235040': 'No',
  '13156664': 'No',
  '16335961': 'No',
  '16025753': 'No',
  '8277700': 'No',
  '23619280': 'No',
  '7978779': 'No',
  '11204496': 'No',
  '16231807': 'No',
  '18314888': 'No',
  '10761379': 'No',
  '12836107': 'No',
  '13349572': 'No',
  '17879203': 'No',
  '19352516': 'No',
  '10284678': 'No',
  '10009672': 'No',
  '15298393': 'No',
  '19259923': 'No',
  '22564855': 'No',
  '19829935': 'No',
  '21909631': 'No',
  '18307992': 'No',
  '10209972': 'No',
  '15029769': 'No',
  '14794212': 'No',
  '11704111': 'No',
  '10197535': 'No',
  '22476307': 'No',
  '12630820': 'No',
  '13803632': 'Yes',
  '18963261': 'No',
  '20620850': 'No',
  '8010315': 'No',
  '21389120': 'No',
  '10063114': 'No',
  '15699727': 'No',
  '22051025': 'No',
  '21686909': 'No',
  '17113220': 'No',
  '16634699': 'No',
  '18424386': 'No',
  '13465441': 'No',
  '10513607': 'No',
  '10726872': 'No',
  '9383198': 'No',
  '16080820': 'No',
  '7494450': 'No',
  '15601283': 'No',
  '19317166': 'No',
  '16155289': 'No',
  '16589565': 'No',
  '10313462': 'No',
  '17032795': 'No',
  '16002803': 'No',
  '9479076': 'No',
  '13849628': 'No',
  '17118986': 'No',
  '17565483': 'No',
  '8494810': 'No',
  '17791680': 'No',
  '15380576': 'No',
  '13885568': 'No',
  '7680846': 'No',
  '10615314': 'No',
  '22471837': 'No',
  '8032199': 'No',
  '22426074': 'No',
  '12433467': 'No',
  '22285101': 'No',
  '20273406': 'No',
  '20247631': 'No',
  '12649337': 'No',
  '22503543': 'No',
  '19283903': 'No',
  '14042162': 'No',
  '11165602': 'No',
  '10036579': 'No',
  '14325467': 'No',
  '22971111': 'No',
  '18804226': 'No',
  '22534285': 'No',
  '21563144': 'No',
  '10680621': 'No',
  '20278115': 'No',
  '22760649': 'No',
  '13785125': 'No',
  '18520156': 'No',
  '22022005': 'No',
  '7727186': 'No',
  '17132415': 'No',
  '7670036': 'No',
  '20154072': 'No',
  '11581079': 'No',
  '11358355': 'No',
  '12144636': 'No',
  '16095866': 'No',
  '17884767': 'No',
  '18594437': 'No',
  '16046789': 'No',
  '9449335': 'No',
  '8133503': 'No',
  '19931973': 'No',
  '16883858': 'No',
  '9537928': 'No',
  '18396397': 'No',
  '13787430': 'No',
  '21899070': 'No',
  '15209158': 'No',
  '21718868': 'No',
  '15819747': 'No',
  '9111644': 'No',
  '18568216': 'No',
  '7701279': 'No',
  '12723890': 'No',
  '20178961': 'No',
  '17617626': 'No',
  '15587326': 'No',
  '11507708': 'No',
  '16034384': 'No',
  '12763710': 'No',
  '9966805': 'No',
  '11188857': 'No',
  '20418962': 'No',
  '21940206': 'No',
  '21924957': 'No',
  '17204857': 'No',
  '12664135': 'No',
  '9563432': 'No',
  '17605010': 'No',
  '19693562': 'No',
  '17493933': 'No',
  '10017716': 'No',
  '15842561': 'No',
  '21485908': 'No',
  '15912800': 'No',
  '13786607': 'No',
  '16185503': 'No',
  '19522301': 'No',
  '13141805': 'No',
  '21321344': 'No',
  '8398362': 'No',
  '18238211': 'No',
  '18390477': 'No',
  '22558354': 'No',
  '16535008': 'No',
  '16314759': 'No',
  '19625654': 'No',
  '18461875': 'No',
  '20642382': 'No',
  '14588689': 'No',
  '11001930': 'No',
  '18695211': 'No',
  '12288904': 'No',
  '14846658': 'No',
  '23734550': 'No',
  '12643807': 'No',
  '10731518': 'No',
  '21535512': 'No',
  '14494409': 'No',
  '7942930': 'No',
  '16813253': 'No',
  '17414665': 'No',
  '9930962': 'No',
  '20331339': 'No',
  '15612395': 'No',
  '9865439': 'No',
  '12625129': 'No',
  '8851916': 'No',
  '14717921': 'No',
  '17566081': 'No',
  '8530607': 'No',
  '14022955': 'No',
  '18251293': 'No',
  '10945212': 'No',
  '11476132': 'No',
  '19464842': 'No',
  '18730698': 'No',
  '15211892': 'No',
  '22827687': 'No',
  '16639965': 'No',
  '16867916': 'No',
  '10097696': 'No',
  '11179770': 'No',
  '18132716': 'No',
  '7883824': 'No',
  '19389462': 'No',
  '18228541': 'No',
  '10572508': 'No',
  '23100306': 'No',
  '15646961': 'No',
  '20252743': 'No',
  '13662074': 'No',
  '19288154': 'No',
  '20584335': 'No',
  '14347817': 'No',
  '23661265': 'No',
  '17905209': 'No',
  '12417318': 'No',
  '12804838': 'No',
  '20865585': 'No',
  '17006950': 'No',
  '21321951': 'No',
  '20003447': 'No',
  '17199055': 'No',
  '15386663': 'No',
  '11510092': 'No',
  '15264510': 'No',
  '9353445': 'No',
  '15259571': 'No',
  '10607681': 'No',
  '22178410': 'No',
  '16795127': 'No',
  '15561875': 'No',
  '7640124': 'No',
  '18736423': 'No',
  '17318799': 'No',
  '19687285': 'No',
  '14328444': 'No',
  '17252624': 'No',
  '23286866': 'No',
  '10200671': 'No',
  '15922272': 'No',
  '15084727': 'No',
  '10150467': 'No',
  '12255814': 'No',
  '8104580': 'No',
  '10964129': 'No',
  '16660928': 'No',
  '22141078': 'No',
  '22881149': 'No',
  '7630451': 'No',
  '10187694': 'No',
  '8592246': 'No',
  '17472057': 'No',
  '19210773': 'No',
  '8744658': 'No',
  '15245547': 'No',
  '23276482': 'No',
  '9511985': 'No',
  '20149217': 'No',
  '22927988': 'No',
  '20496311': 'No',
  '20115805': 'No',
  '17190333': 'No',
  '15448503': 'No',
  '14196231': 'No',
  '22884411': 'No',
  '14723455': 'No',
  '8685970': 'No',
  '15989793': 'No',
  '21141981': 'No',
  '11855482': 'No',
  '22572947': 'No',
  '14941807': 'No',
  '22132099': 'No',
  '22720704': 'No',
  '16728300': 'No',
  '9511025': 'No',
  '13106906': 'No',
  '8676121': 'No',
  '10453973': 'No',
  '9883216': 'No',
  '18821029': 'No',
  '16123612': 'No',
  '8993125': 'No',
  '23139969': 'No',
  '20529022': 'No',
  '23154021': 'No',
  '15039475': 'No',
  '22176189': 'No',
  '14288372': 'No',
  '21347908': 'No',
  '20386255': 'No',
  '15072069': 'No',
  '17308921': 'No',
  '16494943': 'No',
  '20376946': 'No',
  '8077923': 'No',
  '15203229': 'No',
  '19464391': 'No',
  '17017883': 'No',
  '17719273': 'No',
  '15596431': 'No',
  '13992599': 'No',
  '19372007': 'No',
  '8553342': 'No',
  '11972079': 'No',
  '23183067': 'No',
  '10160828': 'No',
  '18346980': 'No',
  '11424894': 'No',
  '17711845': 'No',
  '10096073': 'No',
  '18763161': 'No',
  '21089758': 'No',
  '18594265': 'No',
  '11426575': 'No',
  '22148649': 'No',
  '18153983': 'No',
  '17451046': 'No',
  '21253608': 'No',
  '13092712': 'No',
  '12461997': 'No',
  '11145684': 'No',
  '13726665': 'No',
  '9572405': 'No',
  '16976186': 'No',
  '16584764': 'No',
  '9433803': 'No',
  '17864264': 'No',
  '21356463': 'No',
  '19869822': 'No',
  '12963789': 'No',
  '23670476': 'No',
  '8466217': 'No',
  '11282945': 'No',
  '15452603': 'No',
  '10887611': 'No',
  '13730153': 'No',
  '12980267': 'No',
  '8571679': 'No',
  '9687648': 'No',
  '13062390': 'No',
  '22024016': 'No',
  '23662213': 'No',
  '18399414': 'No',
  '20587294': 'No',
  '22257818': 'No',
  '15284325': 'No',
  '21164838': 'No',
  '17060303': 'No',
  '13474590': 'No',
  '20474254': 'No',
  '23132051': 'No',
  '15742887': 'No',
  '9031876': 'No',
  '18620839': 'No',
  '8538524': 'No',
  '21339452': 'No',
  '10224297': 'No',
  '11628105': 'No',
  '21920449': 'No',
  '11963998': 'No',
  '13899725': 'No',
  '14198998': 'No',
  '22296920': 'No',
  '13060438': 'No',
  '20819865': 'No',
  '12817382': 'No',
  '7794287': 'No',
  '12387741': 'No',
  '22597708': 'No',
  '18418456': 'No',
  '12173441': 'No',
  '22482760': 'No',
  '8365730': 'No',
  '12559676': 'No',
  '21244156': 'No',
  '22790006': 'No',
  '7897503': 'No',
  '7548732': 'No',
  '10053498': 'No',
  '14175684': 'No',
  '9047953': 'No',
  '11293298': 'No',
  '14609030': 'No',
  '19463349': 'No',
  '14641988': 'No',
  '19232536': 'No',
  '12418623': 'No',
  '12575557': 'No',
  '15182835': 'No',
  '21087726': 'No',
  '13509541': 'No',
  '8652482': 'No',
  '8398227': 'No',
  '13766910': 'No',
  '10548876': 'No',
  '15938310': 'No',
  '18292652': 'No',
  '17962933': 'No',
  '23469434': 'No',
  '17661671': 'No',
  '12934994': 'No',
  '10615058': 'No',
  '23423361': 'No',
  '21962697': 'No',
  '23744671': 'No',
  '23390519': 'No',
  '15054628': 'No',
  '13416841': 'No',
  '15533047': 'No',
  '8177170': 'No',
  '13742286': 'No',
  '15739087': 'No',
  '18922952': 'No',
  '21108256': 'No',
  '12940358': 'No',
  '20905460': 'No',
  '19702115': 'No',
  '13724706': 'No',
  '22340687': 'No',
  '16908596': 'No',
  '10367002': 'No',
  '14918283': 'No',
  '22419969': 'No',
  '19079232': 'No',
  '20386637': 'No',
  '18149106': 'No',
  '17350045': 'No',
  '22822293': 'No',
  '22491659': 'No',
  '12906590': 'No',
  '12523243': 'No',
  '18990788': 'No',
  '17856251': 'No',
  '16177388': 'No',
  '13451488': 'No',
  '13285959': 'No',
  '10578689': 'No',
  '18411980': 'No',
  '22673233': 'No',
  '14526234': 'No',
  '22471562': 'No',
  '14253809': 'No',
  '17737761': 'No',
  '11270059': 'No',
  '8949756': 'No',
  '16229803': 'No',
  '23451273': 'No',
  '10165887': 'No',
  '13788518': 'No',
  '22943661': 'No',
  '13630917': 'No',
  '19153381': 'No',
  '11551247': 'No',
  '10532821': 'No',
  '14784310': 'No',
  '22563890': 'No',
  '13016712': 'No',
  '18665972': 'No',
  '10875984': 'No',
  '18184513': 'No',
  '22848441': 'No',
  '22336111': 'No',
  '18642143': 'No',
  '18743940': 'No',
  '13417159': 'No',
  '7832919': 'No',
  '13912272': 'No',
  '20964614': 'No',
  '14328414': 'No',
  '13494137': 'No',
  '22144336': 'No',
  '21400579': 'No',
  '14517244': 'No',
  '10791279': 'No',
  '16427270': 'No',
  '22354579': 'No',
  '22007365': 'No',
  '15392956': 'No',
  '12889821': 'No',
  '20116730': 'No',
  '19450731': 'No',
  '21961187': 'No',
  '16237804': 'No',
  '9265226': 'No',
  '10949864': 'No',
  '15036113': 'No',
  '16087064': 'No',
  ...}}

In [6]:
df5 = pd.DataFrame(list(fraud['target'].items()), columns=['transactions_id', 'is_fraud'])

In [7]:
# making copies of original dataset
users=df1.copy()
cards=df2.copy()
transactions=df3.copy()
codes=df4.copy()
fraud=df5.copy()

In [8]:
# checking shape of each dataset
users.shape

(2000, 14)

In [9]:
cards.shape

(6146, 13)

In [10]:
codes.shape

(109, 2)

In [11]:
fraud.shape

(8914963, 2)

In [12]:
transactions.shape

(13305915, 12)

In [13]:
users.head()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,40.76,-73.74,$37891,$77254,$191349,701,5
2,1718,81,67,1938,11,Female,766 Third Drive,34.02,-117.89,$22681,$33483,$196,698,5
3,708,63,63,1957,1,Female,3 Madison Street,40.71,-73.99,$163145,$249925,$202328,722,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,37.76,-122.44,$53797,$109687,$183855,675,1

In [14]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   object
 10  yearly_income      2000 non-null   object
 11  total_debt         2000 non-null   object
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(2), int64(7), object(5)
memory usage: 218.9+ KB

In [15]:
cards.head()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,$24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,$21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,$46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,$12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,$28,09/2008,2009,No

In [16]:
cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   object
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   object
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: int64(6), object(7)
memory usage: 624.3+ KB

In [17]:
# changing dtype of expires and acct_open_date column
cards['expires'] = pd.to_datetime(cards['expires'], format='%m/%Y')
cards['acct_open_date'] = pd.to_datetime(cards['acct_open_date'], format='%m/%Y')

In [18]:
cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   datetime64[ns]
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   object
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   object
 10  acct_open_date         6146 non-null   datetime64[ns]
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: datetime64[ns](2), int64(6), object(5)
memory usage: 624.3+ KB

In [19]:
transactions.head()

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
0,7475327,2010-01-01 00:01:00,1556,2972,$-77.00,Swipe Transaction,59935,Beulah,ND,58523.0,5499,NaN
1,7475328,2010-01-01 00:02:00,561,4575,$14.57,Swipe Transaction,67570,Bettendorf,IA,52722.0,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,$80.00,Swipe Transaction,27092,Vista,CA,92084.0,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,$200.00,Swipe Transaction,27092,Crown Point,IN,46307.0,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,$46.41,Swipe Transaction,13051,Harwood,MD,20776.0,5813,NaN

In [20]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13305915 entries, 0 to 13305914
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int64
 1   date            object
 2   client_id       int64
 3   card_id         int64
 4   amount          object
 5   use_chip        object
 6   merchant_id     int64
 7   merchant_city   object
 8   merchant_state  object
 9   zip             float64
 10  mcc             int64
 11  errors          object
dtypes: float64(1), int64(5), object(6)
memory usage: 1.2+ GB

In [21]:
# changing dtype of date column
transactions['date'] = pd.to_datetime(transactions['date'])

In [22]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13305915 entries, 0 to 13305914
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int64
 1   date            datetime64[ns]
 2   client_id       int64
 3   card_id         int64
 4   amount          object
 5   use_chip        object
 6   merchant_id     int64
 7   merchant_city   object
 8   merchant_state  object
 9   zip             float64
 10  mcc             int64
 11  errors          object
dtypes: datetime64[ns](1), float64(1), int64(5), object(5)
memory usage: 1.2+ GB

In [23]:
codes.head()

  mcc_id                              category
0   5812         Eating Places and Restaurants
1   5541                      Service Stations
2   7996  Amusement Parks, Carnivals, Circuses
3   5411          Grocery Stores, Supermarkets
4   4784                 Tolls and Bridge Fees

In [24]:
codes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109 entries, 0 to 108
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mcc_id    109 non-null    object
 1   category  109 non-null    object
dtypes: object(2)
memory usage: 1.8+ KB

In [25]:
fraud.head()

  transactions_id is_fraud
0        10649266       No
1        23410063       No
2         9316588       No
3        12478022       No
4         9558530       No

In [26]:
fraud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8914963 entries, 0 to 8914962
Data columns (total 2 columns):
 #   Column           Dtype
---  ------           -----
 0   transactions_id  object
 1   is_fraud         object
dtypes: object(2)
memory usage: 136.0+ MB

In [27]:
# checking null values in users dataset
users.isna().sum()

id                   0
current_age          0
retirement_age       0
birth_year           0
birth_month          0
gender               0
address              0
latitude             0
longitude            0
per_capita_income    0
yearly_income        0
total_debt           0
credit_score         0
num_credit_cards     0
dtype: int64

In [28]:
# checking null values in cards dataset
cards.isna().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [29]:
# checking null values in transactions dataset
transactions.isna().sum()

id                       0
date                     0
client_id                0
card_id                  0
amount                   0
use_chip                 0
merchant_id              0
merchant_city            0
merchant_state     1563700
zip                1652706
mcc                      0
errors            13094522
dtype: int64

In [30]:
# checking null values in codes dataset
codes.isna().sum()

mcc_id      0
category    0
dtype: int64

In [31]:
fraud.isna().sum()

transactions_id    0
is_fraud           0
dtype: int64

In [32]:
# checking nan values of merchant_state dataset
transactions[transactions['merchant_state'].isnull()]

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
7,7475335,2010-01-01 00:14:00,1684,2140,$26.46,Online Transaction,39021,ONLINE,NaN,NaN,4784,NaN
8,7475336,2010-01-01 00:21:00,335,5131,$261.58,Online Transaction,50292,ONLINE,NaN,NaN,7801,NaN
18,7475346,2010-01-01 00:34:00,394,4717,$26.04,Online Transaction,39021,ONLINE,NaN,NaN,4784,NaN
24,7475353,2010-01-01 00:43:00,301,3742,$10.17,Online Transaction,39021,ONLINE,NaN,NaN,4784,NaN
26,7475356,2010-01-01 00:45:00,566,3439,$16.86,Online Transaction,16798,ONLINE,NaN,NaN,4121,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
13305879,23761832,2019-10-31 23:22:00,1556,2972,$17.65,Online Transaction,88459,ONLINE,NaN,NaN,5311,NaN
13305880,23761833,2019-10-31 23:22:00,1797,5660,$34.81,Online Transaction,15143,ONLINE,NaN,NaN,4784,NaN
13305888,23761843,2019-10-31 23:33:00,1069,5167,$59.71,Online Transaction,39021,ONLINE,NaN,NaN,4784,NaN
13305897,23761853,2019-10-31 23:39:00,1422,5696,$694.30,Online Transaction,70268,ONLINE,NaN,NaN,4722,NaN
13305911,23761869,2019-10-31 23:56:00,1766,2066,$12.80,Online Transaction,39261,ONLINE,NaN,NaN,5815,NaN

In [33]:
# dropping those rows in which merchnt_state is nan
transactions=transactions.dropna(subset=['merchant_state'])

In [34]:
# checking nan values in merchant_state column
transactions['merchant_state'].isna().sum()

np.int64(0)

In [35]:
# removing the zip column 
transactions=transactions.drop(columns='zip')

In [36]:
# checking unique values of errors column
transactions['errors'].unique()

array([nan, 'Technical Glitch', 'Insufficient Balance', 'Bad PIN',
       'Bad Zipcode', 'Insufficient Balance,Technical Glitch',
       'Bad PIN,Insufficient Balance', 'Bad PIN,Technical Glitch',
       'Bad Card Number,Insufficient Balance',
       'Bad Zipcode,Insufficient Balance', 'Bad Zipcode,Technical Glitch',
       'Bad CVV', 'Bad Card Number'], dtype=object)

In [37]:
# replacing nan values of errors column
transactions['errors']=transactions['errors'].fillna("No")

In [38]:
# checking nan values in errors column
transactions['errors'].isna().sum()

np.int64(0)

In [39]:
# checking sample values of users
users.sample(5)

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
1455,709,26,66,1993,9,Female,3114 East Street,42.92,-88.84,$21057,$42931,$48783,742,3
1380,550,76,70,1944,2,Male,4937 Maple Lane,47.54,-122.58,$21219,$30248,$35766,763,4
1678,1049,66,67,1953,11,Female,289 Ocean View Avenue,25.77,-80.20,$17893,$36481,$81550,850,6
1483,1247,69,71,1950,9,Female,6466 Ninth Drive,35.54,-118.91,$21654,$44152,$90526,700,5
143,1905,36,68,1983,12,Male,9340 Valley Street,27.48,-82.57,$13972,$28489,$6087,808,4

In [40]:
# removing the retirement_age column 
users.drop(columns=['retirement_age','address'],inplace= True)

In [41]:
# removing $ symbol from per_capita_income, yearly_income and total_debt
users["per_capita_income"] =users["per_capita_income"].str.lstrip("$")
users['yearly_income'] =users['yearly_income'].str.lstrip("$")
users['total_debt'] =users['total_debt'].str.lstrip("$")

In [42]:
# changing the names of users dataset columns
users.rename(columns={'per_capita_income':'per_capita_income_in_$',
                                    'yearly_income':'yearly_income_in_$',
                                    'total_debt':'total_debt_in_$'},inplace = True)

In [43]:
# changing dtype of per_capita_income, yearly_income and total_debt
users["per_capita_income_in_$"] =users["per_capita_income_in_$"].astype('int64')
users['yearly_income_in_$'] =users['yearly_income_in_$'].astype('int64')
users['total_debt_in_$'] =users['total_debt_in_$'].astype('int64')

In [44]:
users.head()

,id,current_age,birth_year,birth_month,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards
0,825,53,1966,11,Female,34.15,-117.76,29278,59696,127613,787,5
1,1746,53,1966,12,Female,40.76,-73.74,37891,77254,191349,701,5
2,1718,81,1938,11,Female,34.02,-117.89,22681,33483,196,698,5
3,708,63,1957,1,Female,40.71,-73.99,163145,249925,202328,722,4
4,1164,43,1976,9,Male,37.76,-122.44,53797,109687,183855,675,1

In [45]:
users['birth_date'] = users['birth_year'].astype(str) + '/' + users['birth_month'].astype(str).str.zfill(2) + '/01'

# Convert to datetime format
users['birth_date'] = pd.to_datetime(users['birth_date'], format='%Y/%m/%d')

# Get current date and convert to datetime
current_date = pd.to_datetime(pd.Timestamp.now().date())

# Calculate the difference in days
users['age'] = (current_date - users['birth_date']).dt.days/ 365.25

# Show the users DataFrame
users['age']=users['age'].astype(int)

In [46]:
# checking users sample values
users.sample(5)

,id,current_age,birth_year,birth_month,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards,birth_date,age
1364,819,55,1964,10,Female,40.43,-79.97,18392,37495,28449,687,3,1964-10-01,60
1736,1678,36,1983,3,Male,41.70,-72.67,28557,58225,101148,685,3,1983-03-01,42
1666,1974,74,1945,4,Female,39.99,-111.81,18058,31792,28723,647,3,1945-04-01,80
1399,615,35,1984,3,Female,29.43,-95.24,21956,44766,68989,713,2,1984-03-01,41
1799,1433,73,1946,3,Male,30.68,-88.04,25381,48060,17440,581,3,1946-03-01,79

In [47]:
# removing unwanted column
users.drop(columns=['current_age','birth_year','birth_month'],inplace=True)

In [48]:
users

,id,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards,birth_date,age
0,825,Female,34.15,-117.76,29278,59696,127613,787,5,1966-11-01,58
1,1746,Female,40.76,-73.74,37891,77254,191349,701,5,1966-12-01,58
2,1718,Female,34.02,-117.89,22681,33483,196,698,5,1938-11-01,86
3,708,Female,40.71,-73.99,163145,249925,202328,722,4,1957-01-01,68
4,1164,Male,37.76,-122.44,53797,109687,183855,675,1,1976-09-01,48
...,...,...,...,...,...,...,...,...,...,...,...
1995,986,Male,40.65,-73.58,23550,48010,87837,703,3,1987-07-01,37
1996,1944,Female,38.95,-84.54,24218,49378,104480,740,4,1957-11-01,67
1997,185,Female,40.66,-74.19,15175,30942,71066,779,3,1973-01-01,52
1998,1007,Male,40.24,-76.92,25336,54654,27241,618,1,1954-02-01,71
1999,1110,Female,42.86,-71.48,32325,65909,181261,673,2,1998-11-01,26

In [49]:
# checking sample values of cards dataset
cards.sample(5)

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
2731,3019,1491,Visa,Debit,4844854154690497,2023-05-01,285,YES,2,$20773,2009-05-01,2011,No
910,2768,684,Mastercard,Debit,5762936498559213,2023-04-01,657,YES,1,$13946,2017-04-01,2017,No
1932,807,1587,Visa,Debit,4600575353397286,2020-02-01,105,YES,1,$35148,2020-01-01,2020,No
2240,5429,64,Mastercard,Credit,5194937321345581,2020-03-01,811,YES,2,$12200,2005-11-01,2020,No
3635,5229,1384,Discover,Credit,6648294893325479,2014-03-01,949,YES,2,$15000,2011-10-01,2011,No

In [50]:
# removing card_number, cvv columns
cards.drop(columns=['card_number','cvv'],inplace=True)

In [51]:
# removing $ symbol from credit_limit column
cards["credit_limit"] =cards["credit_limit"].str.lstrip("$").astype('int64')

In [52]:
# changing the name of cards dataset column
cards.rename(columns={'credit_limit':'credit_limit_in_$'},inplace = True)

In [53]:
cards.head()

,id,client_id,card_brand,card_type,expires,has_chip,num_cards_issued,credit_limit_in_$,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,2022-12-01,YES,2,24295,2002-09-01,2008,No
1,2731,825,Visa,Debit,2020-12-01,YES,2,21968,2014-04-01,2014,No
2,3701,825,Visa,Debit,2024-02-01,YES,2,46414,2003-07-01,2004,No
3,42,825,Visa,Credit,2024-08-01,NO,1,12400,2003-01-01,2012,No
4,4659,825,Mastercard,Debit (Prepaid),2009-03-01,YES,1,28,2008-09-01,2009,No

In [54]:
# checking sample values of transactions dataset
transactions.sample(5)

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,mcc,errors
9443973,18994841,2017-01-25 06:54:00,1466,4634,$46.12,Swipe Transaction,20561,Washington,DC,5912,No
433245,7993789,2010-05-11 10:47:00,602,5979,$11.20,Swipe Transaction,3016,Reidsville,NC,5411,No
5105444,13675819,2013-12-05 06:48:00,205,2861,$65.00,Swipe Transaction,68671,Great Falls,MT,5541,No
8408673,17723833,2016-04-29 00:19:00,706,4284,$33.55,Chip Transaction,48919,Fairfax,CA,5311,No
8493733,17828393,2016-05-21 12:44:00,50,247,$115.64,Chip Transaction,15574,Boca Raton,FL,3393,No

In [55]:
# removing $ symbol from amount column
transactions["amount"] =transactions["amount"].str.lstrip("$").astype('float')

In [56]:
# changing the name of transactions dataset column
transactions.rename(columns={'amount':'amount_in_$'},inplace = True)

In [57]:
# changing the name of transactions dataset column
transactions.rename(columns={'mcc':'mcc_id'},inplace = True)

In [58]:
transactions.head()

,id,date,client_id,card_id,amount_in_$,use_chip,merchant_id,merchant_city,merchant_state,mcc_id,errors
0,7475327,2010-01-01 00:01:00,1556,2972,-77.00,Swipe Transaction,59935,Beulah,ND,5499,No
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,5311,No
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,4829,No
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,4829,No
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,5813,No

In [59]:
# checking sample values of codes dataset
codes.sample(5)

   mcc_id                              category
75   3395                        Welding Repair
30   7230               Beauty and Barber Shops
44   5621          Women's Ready-To-Wear Stores
80   3405                              Ironwork
16   5719  Miscellaneous Home Furnishing Stores

In [60]:
# checking all datasets one by one
users.head()

,id,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards,birth_date,age
0,825,Female,34.15,-117.76,29278,59696,127613,787,5,1966-11-01,58
1,1746,Female,40.76,-73.74,37891,77254,191349,701,5,1966-12-01,58
2,1718,Female,34.02,-117.89,22681,33483,196,698,5,1938-11-01,86
3,708,Female,40.71,-73.99,163145,249925,202328,722,4,1957-01-01,68
4,1164,Male,37.76,-122.44,53797,109687,183855,675,1,1976-09-01,48

In [61]:
# changing id name
users=users.rename(columns={'id':"client_id"})

In [62]:
users.head()

,client_id,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards,birth_date,age
0,825,Female,34.15,-117.76,29278,59696,127613,787,5,1966-11-01,58
1,1746,Female,40.76,-73.74,37891,77254,191349,701,5,1966-12-01,58
2,1718,Female,34.02,-117.89,22681,33483,196,698,5,1938-11-01,86
3,708,Female,40.71,-73.99,163145,249925,202328,722,4,1957-01-01,68
4,1164,Male,37.76,-122.44,53797,109687,183855,675,1,1976-09-01,48

In [63]:
# rearrange the column name
users=users[['client_id','birth_date',"age",'gender','latitude',
       'longitude','per_capita_income_in_$','yearly_income_in_$','total_debt_in_$','credit_score','num_credit_cards']]

In [64]:
users.head()

,client_id,birth_date,age,gender,latitude,longitude,per_capita_income_in_$,yearly_income_in_$,total_debt_in_$,credit_score,num_credit_cards
0,825,1966-11-01,58,Female,34.15,-117.76,29278,59696,127613,787,5
1,1746,1966-12-01,58,Female,40.76,-73.74,37891,77254,191349,701,5
2,1718,1938-11-01,86,Female,34.02,-117.89,22681,33483,196,698,5
3,708,1957-01-01,68,Female,40.71,-73.99,163145,249925,202328,722,4
4,1164,1976-09-01,48,Male,37.76,-122.44,53797,109687,183855,675,1

In [65]:
codes.head()

  mcc_id                              category
0   5812         Eating Places and Restaurants
1   5541                      Service Stations
2   7996  Amusement Parks, Carnivals, Circuses
3   5411          Grocery Stores, Supermarkets
4   4784                 Tolls and Bridge Fees

In [66]:
cards.head()

,id,client_id,card_brand,card_type,expires,has_chip,num_cards_issued,credit_limit_in_$,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,2022-12-01,YES,2,24295,2002-09-01,2008,No
1,2731,825,Visa,Debit,2020-12-01,YES,2,21968,2014-04-01,2014,No
2,3701,825,Visa,Debit,2024-02-01,YES,2,46414,2003-07-01,2004,No
3,42,825,Visa,Credit,2024-08-01,NO,1,12400,2003-01-01,2012,No
4,4659,825,Mastercard,Debit (Prepaid),2009-03-01,YES,1,28,2008-09-01,2009,No

In [67]:
# changing id name
cards= cards.rename(columns={'id':"card_id"})

In [68]:
cards.head()

,card_id,client_id,card_brand,card_type,expires,has_chip,num_cards_issued,credit_limit_in_$,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,2022-12-01,YES,2,24295,2002-09-01,2008,No
1,2731,825,Visa,Debit,2020-12-01,YES,2,21968,2014-04-01,2014,No
2,3701,825,Visa,Debit,2024-02-01,YES,2,46414,2003-07-01,2004,No
3,42,825,Visa,Credit,2024-08-01,NO,1,12400,2003-01-01,2012,No
4,4659,825,Mastercard,Debit (Prepaid),2009-03-01,YES,1,28,2008-09-01,2009,No

In [69]:
transactions.head()

,id,date,client_id,card_id,amount_in_$,use_chip,merchant_id,merchant_city,merchant_state,mcc_id,errors
0,7475327,2010-01-01 00:01:00,1556,2972,-77.00,Swipe Transaction,59935,Beulah,ND,5499,No
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,5311,No
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,4829,No
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,4829,No
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,5813,No

In [70]:
# changing id name
transactions= transactions.rename(columns={'id':"transaction_id"})

In [71]:
transactions.head()

,transaction_id,date,client_id,card_id,amount_in_$,use_chip,merchant_id,merchant_city,merchant_state,mcc_id,errors
0,7475327,2010-01-01 00:01:00,1556,2972,-77.00,Swipe Transaction,59935,Beulah,ND,5499,No
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,5311,No
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,4829,No
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,4829,No
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,5813,No

In [72]:
fraud.head()

  transactions_id is_fraud
0        10649266       No
1        23410063       No
2         9316588       No
3        12478022       No
4         9558530       No

In [73]:
# changing dtype of transactions_id column
fraud['transactions_id']=fraud['transactions_id'].astype("int")

In [74]:
# changing dtype of mcc_id column
codes['mcc_id'] =codes['mcc_id'].astype("int")

In [75]:
# cleaning the extra spacing
def strip_all_objects(df):
    for col in df.columns:
        if df[col].dtype == 'object':
            df[col] = df[col].str.strip()
    return df
dfs = [users, codes, transactions, cards, fraud]
dfs = [strip_all_objects(df) for df in dfs]

In [76]:
# checking duplicate values of all columns
users.duplicated().sum()

np.int64(0)

In [77]:
codes.duplicated().sum()

np.int64(0)

In [78]:
transactions.duplicated().sum()

np.int64(0)

In [79]:
cards.duplicated().sum()

np.int64(0)

In [80]:
fraud.duplicated().sum()

np.int64(0)

In [81]:
# checking shape of each dataset
print(users.shape)
print(codes.shape)
print(fraud.shape)
print(cards.shape)
print(transactions.shape)

(2000, 11)
(109, 2)
(8914963, 2)
(6146, 11)
(11742215, 11)

In [82]:
# store the data set in excel_workbook
with pd.ExcelWriter('users.xlsx') as writer:
    users.to_excel(writer, sheet_name='users', index=False)

In [83]:
with pd.ExcelWriter('cards.xlsx') as writer:
    cards.to_excel(writer, sheet_name='cards', index=False)

In [84]:
with pd.ExcelWriter('codes.xlsx') as writer:
    codes.to_excel(writer, sheet_name='codes', index=False)

In [85]:
fraud.to_csv('fraud.csv',index=False)

In [86]:
transactions.to_csv('transactions.csv',index=False)